models/tmr/flatplate/coarse/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}


scale   1;

vertices
(
    (-0.3333333333333333 0 0)      // 0
    (0.0 0 0)     // 1
    (2.0 0 0)     // 2
    (2.0 1.0 0)   // 3
    (0.0 1.0 0)   // 4
    (-0.3333333333333333 1.0 0)    // 5
    (-0.3333333333333333 0 1)      // 6
    (0.0 0 1)     // 7
    (2.0 0 1)     // 8
    (2.0 1.0 1)   // 9
    (0.0 1.0 1)   // 10
    (-0.3333333333333333 1.0 1)    // 11
);

blocks
(
    hex (0 1 4 5 6 7 10 11) (8 24 1)
        simpleGrading (0.025 85000 1)
    hex (1 2 3 4 7 8 9 10) (26 24 1)
        simpleGrading (100 85000 1)
);

boundary
(
    inlet     { type patch;    faces ((0 6 11 5)); }
    outlet    { type patch;    faces ((2 3 9 8)); }
    top       { type patch;    faces ((5 11 10 4) (4 10 9 3)); }
    bottomSym { type symmetry; faces ((0 1 7 6)); }
    plate     { type wall;     faces ((1 2 8 7)); }
    frontAndBack
    {
        type empty;
        faces ((0 5 4 1) (1 4 3 2) (6 7 10 11) (7 8 9 10));
    }
);
