models/tmr/flatplate/coarse/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}


transportModel  Newtonian;
nu              2e-07;
